

export default {
    themeSelect: "white",
    // 主题
    themes: {
        white: [
            // 背景颜色
            ["--bgColor", "rgb(255, 165, 92)"],
            // 第一屏背景颜色
            ["--firstBgColor", "linear-gradient(to top, rgb(255, 165, 92), rgb(255, 159, 49))"],
            // 山颜色
            ["--hillColor1", "rgb(115, 49, 54)"],
            ["--hillColor2", "rgb(131, 55, 59)"],
            ["--hillColor3", "rgb(162, 72, 80)"],
            ["--hillColor4", "rgb(221, 102, 107)"],
            // 大地颜色
            ["--earth", "linear-gradient(to top right, rgb(202, 112, 117), rgb(126, 50, 53))"],
            // 小草颜色
            ["--cao", "linear-gradient(to top, rgb(202, 112, 117), rgb(126, 50, 53))"],
            // 标题文字颜色
            ["--titleColor", "rgb(255, 69, 32)"],
            // 标题文字阴影
            ["--titleShadow", "2px 2px 0px rgba(255, 255, 255, .8), 0 0 10px rgba(0, 0, 0, .5)"],
            // 图标菜单阴影
            ["--iconShadow", "0 0 5px white"],
        ],
        dark: [
            // 背景颜色
            ["--bgColor", "rgb(48, 37, 95)"],
            // 第一屏背景颜色
            ["--firstBgColor", "linear-gradient(to top, rgb(78, 36, 88), rgb(13, 18, 51))"],
            // 山颜色
            ["--hillColor1", "rgb(36, 32, 74)"],
            ["--hillColor2", "rgb(41, 35, 94)"],
            ["--hillColor3", "rgb(65, 37, 71)"],
            ["--hillColor4", "rgb(87, 50, 95)"],
            // 大地颜色
            ["--earth", "linear-gradient(to top right, rgb(43, 38, 95), rgb(61, 36, 95))"],
            // 小草颜色
            ["--cao", "linear-gradient(to top, rgb(85, 49, 96), rgb(78, 72, 128))"],
            // 标题文字颜色
            ["--titleColor", "rgb(136, 65, 167)"],
            // 标题文字阴影
            ["--titleShadow", "2px 2px 0px rgba(255, 255, 255, .8), 0 0 10px rgba(0, 0, 0, .5)"],
            // 图标菜单阴影
            ["--iconShadow", "0 0 2px white"],
        ]
    },
    lovexhj1: {
        title: "对爸爸妈妈说的悄悄话",
        subTitle: "24周岁的女儿寄语",
    },
    lovexhj2: {
        content: `                    <h1>亲爱的爸爸妈妈</h1>
        <h2>我是你们的小棉袄👧</h2>
        <br></br>
        <p>今年已经24岁的我想和爸爸妈妈说说悄悄话💭</p>
        <br></br>
        <p>女儿向来不太乖巧 也不沉稳 还是不是叛逆总让你们担心</p>
        <br></br>
        <p>远到高中的莫名的脾气 考研时选择的矛盾 再到最近的固执割双眼皮🕓一直都不省心</p>
        <br></br>
        <p>对不起 好像也总是会把身上的倒刺伤到最亲近的人 对弟弟也是（老弟还是非常厉害让我骄傲钦佩滴）</p>
        <br></br>
        <p>当时的我都没有很齐全的想好所有的事情，一边犹豫着，一边冲动着，
        甚至为了想要割双眼皮，还说出了很伤你们的话，还说出了比较重的话，像爸爸为什么要把没有双眼皮遗传给我，
        真的很对不起，说出之后自己蛮后悔的，并没有说对爸爸妈妈原生给的不满意或是责怪，但自己又很犟，说不出很道歉的话。😨 </p>
        <br></br>
        <p>可能爸爸说的对，我这种心态已经被影响的不健康了，这个年纪的女孩子啊，总是会被很多比较着，影响着。</p>
        <br></br>
        <p>在割双眼皮前，我是这样的一个状态，是不管素颜也好，化妆也好，都习惯性的贴双眼皮贴（因为被夸好看）。早上很可能眼睛不好贴，撑不起来，从那种软的双眼皮贴贴到硬的，
        贴了三年，在学校的每一天。因为那种我又容易出汗，然后走到哪都会需要带一些双眼皮贴去补妆一样。不贴的时候会很不自信，我的手机里近三年基本找不到没有不贴双眼皮贴的照片🙁</p>
        <br></br>
        <p>终究是自己贪心了🙁自我狭隘了</p>
        <br></br>
        <p>我也不知道自己的决定是否正确👣已经24岁了的我，在很多时候，并没有觉得自己像长大了一样，有时候心思细腻又敏感，也不知道这样的状态是好事还是坏事。</p>
        <br></br>
        <p>但是请爸爸妈妈放心，你们的女儿你一直努力开心进步下去，虽然也经常在你们面前流泪，跟你们抱怨很多事情会跟你们说很多开心的或不开心的。
        可是哦~好的坏的都压不倒我的，我会坚定的更加爱自己，坚定的永远爱你们！你们是我最好的家人！🤗</p>
        <br></br>   
        <p>超级幸运是你们的宝贝女儿，遇见你们已经是我的上上签🔖。</p>
        <br></br>  
        <p>我还有好多好多想和你们一起见证完成的目标和事情，所有未完待续🍀</p>
        <br></br>   
        `,
        img: "https://lovexhj.oss-cn-beijing.aliyuncs.com/me/images/me.jpg"
    }

}
